app/views/usuarios/admins/predios.html.erb

SELECT `usuarios`.* FROM `usuarios` WHERE `usuarios`.`id` = 1 LIMIT 1
---
	Nome: <b><%= x.nome %></b><br/>
	Sindico: <b><%= Usuario.find_by_id(x.sindico_id).nome %></b><br/>