app/views/condominios/_agendas.html.erb

    <li class="nav-header"><%= agenda.nome %></li>
    <% agenda.eventos.each do |evento| %>
---
SELECT `eventos`.* FROM `eventos` WHERE `eventos`.`agenda_id` = 1