app/controllers/agendas/eventos_controller.rb

SELECT `agendas`.* FROM `agendas` WHERE `agendas`.`slug` = 'salao-de-festas' LIMIT 1
SELECT `eventos`.* FROM `eventos` WHERE (agenda_id = 1 AND dia >= '2012-10-20')
---
  def index
    agenda = Agenda.find_by_slug(params[:agenda_id])
    @eventos = Evento.find(:all, :conditions => ['agenda_id = ? AND dia >= ?', agenda.id, Date.today])

SELECT `condominios`.* FROM `condominios` WHERE `condominios`.`slug` = 'mirante-campestre' LIMIT 1
SELECT `agendas`.* FROM `agendas` WHERE `agendas`.`slug` = 'salao-de-festas' LIMIT 1
---
  def new
    @evento = Evento.new
    @condominio = Condominio.find_by_slug(params[:condominio_id])
    @agenda = Agenda.find_by_slug(params[:agenda_id])

SELECT `agendas`.* FROM `agendas` WHERE `agendas`.`slug` = 'salao-de-festas' LIMIT 1
INSERT INTO `eventos` (`agenda_id`, `created_at`, `descricao`, `dia`, `status`, `titulo`, `updated_at`, `usuario_id`) VALUES (1, '2012-10-20 20:17:33', 'Teste de evento', '2012-10-31', NULL, 'Meu aniversário', '2012-10-20 20:17:33', 1)
---
  def create
    agenda = Agenda.find_by_slug(params[:agenda_id])
    @evento = Evento.new(params[:evento])

    @evento.agenda_id = agenda
    @evento.usuario_id = current_usuario.id

    respond_to do |format|
      if @evento.save