app/controllers/usuarios/admins_controller.rb

SELECT `predios`.* FROM `predios` WHERE `predios`.`condominio_id` = 1
---
	def predios
		condominio_id = current_usuario.apartamento.predio.condominio.id

		@predios = Predio.find_all_by_condominio_id(condominio_id)