app/views/usuarios/_form.html.erb

SELECT `tipo_usuarios`.* FROM `tipo_usuarios`
---
    <%= f.input :tamanho_familia, :label => 'Tamanho da familia', :collection => 1..10 %>
    <%= f.collection_radio_buttons :tipo_usuario_id, TipoUsuario.all, :id, :nome %>