app/controllers/agendas_controller.rb

SELECT `agendas`.* FROM `agendas` WHERE `agendas`.`condominio_id` = 3
---
  def index
    @agendas = Agenda.find_all_by_condominio_id(meu_condominio)