app/controllers/avisos_controller.rb

SELECT `avisos`.* FROM `avisos` WHERE `avisos`.`condominio_id` = 3
---
  def index
    @avisos = Aviso.find_all_by_condominio_id(meu_condominio)