app/controllers/banners_controller.rb

  def index
    @banners = Banner.all
---
SELECT `banners`.* FROM `banners`

  def show
    @banner = Banner.find(params[:id])
---
SELECT `banners`.* FROM `banners` WHERE `banners`.`id` = 1 LIMIT 1

  def create
    @banner = Banner.new(params[:banner])

    respond_to do |format|
      if @banner.save
---
INSERT INTO `banners` (`ativo`, `clicks`, `created_at`, `data`, `imagem_content_type`, `imagem_file_name`, `imagem_file_size`, `imagem_updated_at`, `pageviews`, `parceiro_id`, `path`, `updated_at`, `url`) VALUES (1, NULL, '2012-04-02 05:00:09', '2012-04-02 04:56:00', 'image/jpeg', 'banner_oficina.jpg', 11398, '2012-04-02 05:00:07', NULL, 1, '', '2012-04-02 05:00:09', 'http://www.oficinadopao.com.br')