app/controllers/campanhas_controller.rb

  def index
    @campanhas = Campanha.all
---
SELECT `campanhas`.* FROM `campanhas`

  def show
    @campanha = Campanha.find(params[:id])
---
SELECT `campanhas`.* FROM `campanhas` WHERE `campanhas`.`id` = 1 LIMIT 1

  def create
    @campanha = Campanha.new(params[:campanha])

    respond_to do |format|
      if @campanha.save
---
INSERT INTO `campanhas` (`ativo`, `clicks`, `created_at`, `data_fim`, `data_inicio`, `pageviews`, `parceiro_id`, `publicidade_id`, `publicidade_tipo`, `updated_at`) VALUES (1, NULL, '2012-04-03 06:18:24', '2012-04-04 06:16:00', '2012-04-03 06:16:00', NULL, 1, 1, 'Banner', '2012-04-03 06:18:24')