app/controllers/condominios_controller.rb

SELECT `condominios`.* FROM `condominios`
---
  def index
    @condominios = Condominio.all

SELECT `condominios`.* FROM `condominios` WHERE `condominios`.`id` = 0 LIMIT 1
SELECT `murals`.* FROM `murals` WHERE `murals`.`condominio_id` = 2
SELECT `avisos`.* FROM `avisos` WHERE `avisos`.`id` = 1 AND `avisos`.`condominio_id` = 3 LIMIT 1
SELECT `ofertas`.* FROM `ofertas` LIMIT 1
SELECT `agendas`.* FROM `agendas` WHERE `agendas`.`condominio_id` = 3
---
  def show
    @condominio = Condominio.find(params[:id])
    @murais = Mural.where(:condominio_id => @condominio)
    @murais.where(:publico => true) unless current_usuario


    #aviso_id = current_usuario.ultimo_aviso_visto.to_i + 1
    aviso_id = 1

    @aviso = Aviso.where(:id => aviso_id, :condominio_id => @condominio).first

    #TEMP DE OFERTAS
    #TODO: Criar campanhas
    @oferta = Oferta.first

    @agendas = Agenda.find_all_by_condominio_id(@condominio.id)

SELECT `condominios`.* FROM `condominios` WHERE `condominios`.`id` = 1 LIMIT 1
SELECT `tipo_servicos`.* FROM `tipo_servicos`
SELECT `servicos`.* FROM `servicos` INNER JOIN `servicos_tipo_servicos` ON `servicos`.`id` = `servicos_tipo_servicos`.`servico_id` WHERE `servicos_tipo_servicos`.`tipo_servico_id` = 2
---
  def servicos
    @condominio = Condominio.find(params[:id])
    @tipos_servicos = TipoServico.all

    #if params[:tipo].empty?
      @tipo = TipoServico.find(params[:tipo])
      @servicos = @tipo.servicos.all