app/controllers/home_controller.rb

  def index
      @condominios = Condominio.all
---
SELECT `condominios`.* FROM `condominios`