app/controllers/ofertas_controller.rb

SELECT `ofertas`.* FROM `ofertas`
---
  def index
    @ofertas = Oferta.all

SELECT `ofertas`.* FROM `ofertas` WHERE `ofertas`.`id` = 1 LIMIT 1
---
  def show
    @oferta = Oferta.find(params[:id])

SELECT `ofertas`.* FROM `ofertas` WHERE `ofertas`.`id` = 1 LIMIT 1
---
  def edit
    @oferta = Oferta.find(params[:id])

INSERT INTO `ofertas` (`ativo`, `created_at`, `data`, `descricao`, `foto_content_type`, `foto_file_name`, `foto_file_size`, `foto_updated_at`, `parceiro_id`, `preco_de`, `preco_por`, `titulo`, `updated_at`) VALUES (1, '2012-03-22 03:33:00', '2012-03-22 03:32:00', 'Que pão gostoso agora na sua casa!', NULL, NULL, NULL, NULL, 1, '2,00', '1,00', 'Pão fresquinho', '2012-03-22 03:33:00')
---
  def create
    @oferta = Oferta.new(params[:oferta])

    respond_to do |format|
      if @oferta.save

SELECT `ofertas`.* FROM `ofertas` WHERE `ofertas`.`id` = 1 LIMIT 1
UPDATE `ofertas` SET `foto_file_name` = 'Pôr-do-sol-na-Praia6.jpg', `foto_content_type` = 'image/jpeg', `foto_file_size` = 368096, `foto_updated_at` = '2012-03-18 16:30:38', `updated_at` = '2012-03-18 16:30:38' WHERE `ofertas`.`id` = 1
---
  def update
    @oferta = Oferta.find(params[:id])

    respond_to do |format|
      if @oferta.update_attributes(params[:oferta])