app/controllers/paginas_controller.rb

SELECT `paginas`.* FROM `paginas`
---
  def index
    @paginas = Pagina.all

SELECT `paginas`.* FROM `paginas` WHERE `paginas`.`id` = 7 LIMIT 1
---
  def show
    @pagina = Pagina.find(params[:id])