app/controllers/parceiros_controller.rb

  def index
    @parceiros = Parceiro.all
---
SELECT `parceiros`.* FROM `parceiros`

  def show
    @parceiro = Parceiro.find(params[:id])
---
SELECT `parceiros`.* FROM `parceiros` WHERE `parceiros`.`id` = 1 LIMIT 1

  def create
    @parceiro = Parceiro.new(params[:parceiro])

    respond_to do |format|
      if @parceiro.save
---
INSERT INTO `parceiros` (`created_at`, `email`, `endereco`, `nome`, `telefone`, `updated_at`) VALUES ('2012-02-28 14:38:21', 'vinny.rangel@gmail.com', 'Rua retiro dos artistas, 1931', 'Vinicius Rangel', '(21) 9377-5857', '2012-02-28 14:38:21')