app/controllers/servicos_controller.rb

  def index
    @servicos = Servico.all
---
SELECT `servicos`.* FROM `servicos`

  def show
    @servico = Servico.find(params[:id])
---
SELECT `tipo_servicos`.* FROM `tipo_servicos` WHERE `tipo_servicos`.`servico_id` = 1

  def new
    @servico = Servico.new
    @tipoServico = TipoServico.all
---
SELECT `tipo_servicos`.* FROM `tipo_servicos`

  def edit
    @servico = Servico.find(params[:id])
    @tiposervico = TipoServico.all
---
SELECT `servicos`.* FROM `servicos` WHERE `servicos`.`id` = 1 LIMIT 1
SELECT `tipo_servicos`.* FROM `tipo_servicos`

  def create
    @servico = Servico.new(params[:servico])

    respond_to do |format|
      if @servico.save
---
INSERT INTO `servicos` (`created_at`, `descricao`, `endereco`, `foto_content_type`, `foto_file_name`, `foto_file_size`, `foto_updated_at`, `nome`, `telefone`, `tipo_servico_id`, `updated_at`) VALUES ('2012-03-25 20:30:03', 'Na padaria Oficina do Pão, você escontra tudo de bom para você!', 'Rua Retiro dos Artistas, 1931', 'image/jpeg', 'pães_e_bolos.jpg', 69534, '2012-03-25 20:30:01', 'Pães, Bolos e Tortas', '3242-9878', 1, '2012-03-25 20:30:03')

  def update
    @servico = Servico.find(params[:id])
---
SELECT `tipo_servicos`.* FROM `tipo_servicos` WHERE `tipo_servicos`.`id` IN (2, 3)