app/controllers/usuarios_controller.rb

  def show
    @user = Usuario.find(params[:id])
---
SELECT `usuarios`.* FROM `usuarios` WHERE `usuarios`.`id` = 1 LIMIT 1

  def update
    @user = Usuario.find(params[:id])
---
SELECT `usuarios`.* FROM `usuarios` WHERE `usuarios`.`id` = 1 LIMIT 1